Билет12/Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет12/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗаказать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтгрузить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет12/Documents/ЗаказПокупателя/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказПокупателяСписокНоменклатуры.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.СписокНоменклатуры КАК ЗаказПокупателяСписокНоменклатуры
		|ГДЕ
		|	ЗаказПокупателяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяСписокНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.ЗаказПокупателя = Ссылка;
		Движение.КоличествоЗаказать = ВыборкаДетальныеЗаписи.Количество;
		Движение.КоличествоОтгрузить = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
